import React from "react";
import Mainweel from "@/src/animation/animation3/Mainweel";

function About() {
  return (
    <>
      <div id="about" className="w-full h-screen flex flex-col">
        <h1 className="m-auto text-[40px] font-black mt-10">درباره ما</h1>
        <div className="w-[90%] m-auto h-screen flex flex-row justify-center items-center">
          <div className="w-[60%] h-screen text-[20px] mt-20">
            <h1 className="font-bold ">
              تخصص، تعهد و اعتماد؛ سه ستون اصلی خدمات ما
            </h1>
            <h2>
              در مجموعه{" "}
              <span style={{ color: "#ff6600", fontWeight: "bold" }}>
                اصغردیاگ
              </span>
              ، ما فقط به تعمیر و نگهداری خودرو نمی‌پردازیم؛ بلکه با هر خودرو،
              مسئولیتی را می‌پذیریم که برای ما ارزشمندتر از هر چیز دیگری‌ست:
              اعتماد شما. با بیش از{" "}
              <span style={{ fontWeight: "bold" }}>30 سال</span> تجربه تخصصی در
              ارائه خدمات مکانیکی، الکتریکی و فنی خودروهای داخلی و خارجی، تیم ما
              از مهندسان و تکنسین‌های آموزش‌دیده، همواره در تلاش‌اند تا کیفیتی
              فراتر از انتظار را برای شما به ارمغان بیاورند.
            </h2>

            <h3>
              ما به کیفیت خدمات، شفافیت در ارتباط با مشتری و پاسخ‌گویی متعهد
              هستیم. در هر مرحله از خدمات، از تشخیص دقیق مشکل گرفته تا تعمیر و
              تحویل نهایی خودرو، شما را در جریان تمامی جزئیات قرار می‌دهیم. باور
              داریم که ایجاد حس آرامش و اطمینان، بخشی از مسئولیت حرفه‌ای ماست.
              این صداقت و شفافیت، پایه‌ی ارتباط بلندمدت ما با مشتریان‌مان بوده
              است.
            </h3>
            <h4>
              <span style={{ fontWeight: "bold" }}>
                رضایت شما بزرگ‌ترین سرمایه ماست
              </span>{" "}
              ما نه‌تنها به رفع ایرادهای فنی خودرو می‌پردازیم، بلکه با ارائه
              راهکارهای نگهداری هوشمندانه و مشاوره تخصصی، به ارتقاء عملکرد خودرو
              و کاهش هزینه‌های آتی شما کمک می‌کنیم. هدف نهایی ما این است که هر
              بار که به خدمات ما نیاز داشتید، با اطمینان و آرامش خاطر بازگردید.
            </h4>
          </div>
          <div className="w-40%">
            <Mainweel />
          </div>
        </div>
      </div>
    </>
  );
}

export default About;
